tutorials/rheoFoam/OtherTests/Channel2D_VE/multiMode/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{                

        type multiMode;

        models
        (
            M1
            {
                type             FENE-PLog;

                rho              rho [1 -3 0 0 0 0 0] 1.;
                etaS             etaS [1 -1 -1 0 0 0 0] .005;
                etaP             etaP [1 -1 -1 0 0 0 0] .99;             
                lambda           lambda [0 0 1 0 0 0 0] .1;
                L2               L2 [0 0 0 0 0 0 0] 10;

                stabilization    coupling;       
            }   
            M2
            {
                type             Oldroyd-BLog;

                rho              rho [1 -3 0 0 0 0 0] 1.;
                etaS             etaS [1 -1 -1 0 0 0 0] .005;
                etaP             etaP [1 -1 -1 0 0 0 0] .99;             
                lambda           lambda [0 0 1 0 0 0 0] .1;

                stabilization    coupling;      
            } 
        );            
}

passiveScalarProperties
{
                solvePassiveScalar   no;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

// ************************************************************************* //
